proddy/EMS-ESP32/src/core/system.cpp
    auto current_partition = (const char *)esp_ota_get_running_partition()->label;

    // update the current version and partition name in NVS if not already set
    if (EMSESP::nvs_.getString(current_partition) != EMSESP_APP_VERSION || emsesp::EMSESP::nvs_.getBool(emsesp::EMSESP_NVS_BOOT_NEW_FIRMWARE, true)) {
        EMSESP::nvs_.putBool(emsesp::EMSESP_NVS_BOOT_NEW_FIRMWARE, false);
        EMSESP::nvs_.putString(current_partition, EMSESP_APP_VERSION);
        char c[20];
        snprintf(c, sizeof(c), "d_%s", current_partition);
        auto t = time(nullptr);
        // write timestamp always with new version, if clock is not set, this will be updated with ntp
        EMSESP::nvs_.putULong(c, t);
    }

    // Loop through all available partitions and update map with the version info pulled from NVS
    // Partitions can be app0, app1, factory, boot
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    uint64_t                 buffer;

    while (it != nullptr) {
        bool                    is_valid = true;
        const esp_partition_t * part     = esp_partition_get(it);

        if (part->label != nullptr && part->label[0] != '\0') {
            // check if partition is valid and not empty
            esp_partition_read(part, 0, &buffer, 8);
            if (buffer == 0xFFFFFFFFFFFFFFFF) {
                is_valid = false; // skip this partition
            }
        }

        // get the version from the NVS store, and add to map
        if (is_valid) {
            PartitionInfo p_info;
            // if there is an entry for this partition in NVS, get it's version from NVS
            p_info.version = EMSESP::nvs_.getString(part->label, "").c_str();
            char c[20];
            snprintf(c, sizeof(c), "d_%s", (const char *)part->label);
            time_t d = EMSESP::nvs_.getULong(c, 0);
            char   time_string[25];
            strftime(time_string, sizeof(time_string), "%FT%T", localtime(&d));
            p_info.install_date = d > 1500000000L ? time_string : "";

            esp_image_metadata_t meta     = {};
            esp_partition_pos_t  part_pos = {.offset = part->address, .size = part->size};
            if (esp_image_verify(ESP_IMAGE_VERIFY_SILENT, &part_pos, &meta) == ESP_OK) {
                p_info.size = meta.image_len / 1024; // actual firmware size in KB
            } else {
                p_info.size = 0;
            }

            partition_info_[part->label] = p_info;
        }

        it = esp_partition_next(it); // loop to next partition
    }
    esp_partition_iterator_release(it);
#endif
}

// set NTP install time/date for the current partition
// assumes NTP is connected and working
void System::set_partition_install_date() {
#ifndef EMSESP_STANDALONE
    auto current_partition = (const char *)esp_ota_get_running_partition()->label;
    if (current_partition == nullptr) {
        return; // fail-safe
    }

    char c[20];
    snprintf(c, sizeof(c), "d_%s", current_partition);
    time_t d = EMSESP::nvs_.getULong(c, 0);
    if (d < 1500000000L) {
        LOG_DEBUG("Setting the install date in partition %s", current_partition);
        auto t = time(nullptr) - uuid::get_uptime_sec();
        EMSESP::nvs_.putULong(c, t);
    }
#endif
}

// sets the partition to use on the next restart
bool System::set_partition(const char * partitionname) {
#ifdef EMSESP_STANDALONE
    return true;
#else
    if (partitionname == nullptr) {
        return false;
    }

    // Find the partition by label
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, partitionname);
    if (it == nullptr) {
        return false; // partition not found
    }

    const esp_partition_t * partition = esp_partition_get(it);
    esp_partition_iterator_release(it);

    if (partition == nullptr) {
        return false;
    }

    // Set the boot partition
    esp_err_t err = esp_ota_set_boot_partition(partition);
    if (err != ESP_OK) {
        return false;
    }

    // initiate the restart
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
#endif
}

// restart EMS-ESP
// app0 or app1, or boot/factory on 16MB boards
void System::system_restart(const char * partitionname) {
#ifndef EMSESP_STANDALONE
    // see if we are forcing a partition to use
    if (partitionname != nullptr) {
        // Factory partition - label will be "factory"
        const esp_partition_t * partition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
        if (partition && !strcmp(partition->label, partitionname)) {
            esp_ota_set_boot_partition(partition);
        } else
            // try and find the partition by name
            if (strcmp(esp_ota_get_running_partition()->label, partitionname)) {
                // not found, get next one in cycle
                partition = esp_ota_get_next_update_partition(nullptr);
                if (!partition) {
                    LOG_ERROR("Partition '%s' not found", partitionname);
                    return;
                }
                if (strcmp(partition->label, partitionname) && strcmp(partitionname, "boot") != 0) {
                    partition = esp_ota_get_next_update_partition(partition);
                    if (!partition || strcmp(partition->label, partitionname)) {
                        LOG_ERROR("Partition '%s' not found", partitionname);
                        return;
                    }
                }
                // error if partition is empty
                uint64_t buffer;
                esp_partition_read(partition, 0, &buffer, 8);
                if (buffer == 0xFFFFFFFFFFFFFFFF) {
                    LOG_ERROR("Partition '%s' is empty, not bootable", partition->label);
                    return;
                }
                // set the boot partition
                esp_ota_set_boot_partition(partition);
            }
        LOG_INFO("Restarting EMS-ESP from %s partition", partitionname);
    } else {
        LOG_INFO("Restarting EMS-ESP...");
    }

    // make sure it's only executed once
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_NORMAL);

