proddy/EMS-ESP32/src/core/system.cpp
    store_nvs_values(); // save any NVS values
    Shell::loop_all();  // flush log to output
    Mqtt::disconnect(); // gracefully disconnect MQTT, needed for QOS1
    EMSuart::stop();    // stop UART so there is no interference
    delay(1000);        // wait 1 second
    ESP.restart();      // ka-boom!
#else
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_NORMAL);
    if (partitionname != nullptr) {
        LOG_INFO("Restarting EMS-ESP from %s partition", partitionname);
    } else {
        LOG_INFO("Restarting EMS-ESP...");
    }
#endif
}

// saves all settings
void System::wifi_reconnect() {
    EMSESP::esp32React.getNetworkSettingsService()->read(
        [](NetworkSettings & networkSettings) { LOG_INFO("WiFi reconnecting to SSID '%s'...", networkSettings.ssid.c_str()); });
    delay(500);                                                           // wait
    EMSESP::webSettingsService.save();                                    // save local settings
    EMSESP::esp32React.getNetworkSettingsService()->callUpdateHandlers(); // in case we've changed ssid or password
}

void System::syslog_init() {
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        syslog_enabled_       = settings.syslog_enabled;
        syslog_level_         = settings.syslog_level;
        syslog_mark_interval_ = settings.syslog_mark_interval;
        syslog_host_          = settings.syslog_host;
        syslog_port_          = settings.syslog_port;
    });
#ifndef EMSESP_STANDALONE
    if (syslog_enabled_) {
        // start & configure syslog
        syslog_.maximum_log_messages(10);
        syslog_.log_level((uuid::log::Level)syslog_level_);
        syslog_.mark_interval(syslog_mark_interval_);
        syslog_.destination(syslog_host_.c_str(), syslog_port_);
        syslog_.hostname(hostname());
        EMSESP::logger().info("Starting Syslog service");
    } else if (syslog_.started()) {
        // in case service is still running, this flushes the queue
        // https://github.com/emsesp/EMS-ESP/issues/496
        EMSESP::logger().info("Stopping Syslog");
        syslog_.loop();
        syslog_.log_level(uuid::log::Level::OFF); // stop server
        syslog_.mark_interval(0);
        // syslog_.destination("");
    }
    if (Mqtt::publish_single()) {
        if (Mqtt::publish_single2cmd()) {
            Mqtt::queue_publish("system/syslog", syslog_enabled_ ? (FL_(list_syslog_level)[syslog_level_ + 1]) : "off");
            if (EMSESP::watch_id() == 0 || EMSESP::watch() == 0) {
                Mqtt::queue_publish("system/watch",
                                    EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(EMSESP::watch()) : (FL_(list_watch)[EMSESP::watch()]));
            } else {
                Mqtt::queue_publish("system/watch", Helpers::hextoa(EMSESP::watch_id()));
            }

        } else {
            Mqtt::queue_publish("system_data/syslog", syslog_enabled_ ? (FL_(list_syslog_level)[syslog_level_ + 1]) : "off");
            if (EMSESP::watch_id() == 0 || EMSESP::watch() == 0) {
                Mqtt::queue_publish("system_data/watch",
                                    EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(EMSESP::watch()) : (FL_(list_watch)[EMSESP::watch()]));
            } else {
                Mqtt::queue_publish("system_data/watch", Helpers::hextoa(EMSESP::watch_id()));
            }
        }
    }
#endif
}

// read specific major system settings to store locally for faster access
void System::store_settings(WebSettings & settings) {
    version_ = settings.version;

    rx_gpio_      = settings.rx_gpio;
    tx_gpio_      = settings.tx_gpio;
    pbutton_gpio_ = settings.pbutton_gpio;
    dallas_gpio_  = settings.dallas_gpio;
    led_gpio_     = settings.led_gpio;

    analog_enabled_ = settings.analog_enabled;
    low_clock_      = settings.low_clock;
    hide_led_       = settings.hide_led;
    led_type_       = settings.led_type;
    board_profile_  = settings.board_profile;
    telnet_enabled_ = settings.telnet_enabled;

    tx_mode_              = settings.tx_mode;
    syslog_enabled_       = settings.syslog_enabled;
    syslog_level_         = settings.syslog_level;
    syslog_mark_interval_ = settings.syslog_mark_interval;
    syslog_host_          = settings.syslog_host;
    syslog_port_          = settings.syslog_port;

    fahrenheit_     = settings.fahrenheit;
    bool_format_    = settings.bool_format;
    bool_dashboard_ = settings.bool_dashboard;
    enum_format_    = settings.enum_format;
    readonly_mode_  = settings.readonly_mode;

    phy_type_       = settings.phy_type;
    eth_power_      = settings.eth_power;
    eth_phy_addr_   = settings.eth_phy_addr;
    eth_clock_mode_ = settings.eth_clock_mode;

    locale_         = settings.locale;
    developer_mode_ = settings.developer_mode;
    // start services
    if (settings.modbus_enabled) {
        if (EMSESP::modbus_ == nullptr) {
            EMSESP::modbus_ = new Modbus;
            EMSESP::modbus_->start(1, settings.modbus_port, settings.modbus_max_clients, settings.modbus_timeout * 1000);
        } else if (settings.modbus_port != modbus_port_ || settings.modbus_max_clients != modbus_max_clients_ || settings.modbus_timeout != modbus_timeout_) {
            EMSESP::modbus_->stop();
            EMSESP::modbus_->start(1, settings.modbus_port, settings.modbus_max_clients, settings.modbus_timeout * 1000);
        }
    } else if (EMSESP::modbus_ != nullptr) {
        EMSESP::modbus_->stop();
        delete EMSESP::modbus_;
        EMSESP::modbus_ = nullptr;
    }
    modbus_enabled_     = settings.modbus_enabled;
    modbus_port_        = settings.modbus_port;
    modbus_max_clients_ = settings.modbus_max_clients;
    modbus_timeout_     = settings.modbus_timeout;
}

// Starts up core services
void System::start() {
    get_partition_info(); // get the partition info

#ifndef EMSESP_STANDALONE
    // disable bluetooth module
    // periph_module_disable(PERIPH_BT_MODULE);
    if (low_clock_) {
#if CONFIG_IDF_TARGET_ESP32C3
        setCpuFrequencyMhz(80);
#else
        setCpuFrequencyMhz(160);
#endif
    }

