proddy/EMS-ESP32/src/core/system.cpp
    // get current memory values
    fstotal_ = LittleFS.totalBytes() / 1024; // read only once, it takes 500 ms to read
    appused_ = ESP.getSketchSize() / 1024;
    appfree_ = esp_ota_get_running_partition()->size / 1024 - appused_;
    refreshHeapMem(); // refresh free heap and max alloc heap
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S2
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
    temperature_sensor_install(&temp_sensor_config, &temperature_handle_);
    temperature_sensor_enable(temperature_handle_);
    temperature_sensor_get_celsius(temperature_handle_, &temperature_);
#endif
#endif

    EMSESP::esp32React.getNetworkSettingsService()->read([&](NetworkSettings & networkSettings) {
        hostname(networkSettings.hostname.c_str()); // sets the hostname
    });

    commands_init(); // console & api commands
    led_init();      // init LED
    button_init();   // button
    network_init();  // network
    uart_init();     // start UART
    syslog_init();   // start syslog
}

// button single click
void System::button_OnClick(PButton & b) {
    LOG_NOTICE("Button pressed - single click");

#if defined(EMSESP_TEST)
#ifndef EMSESP_STANDALONE
    // show filesystem
    Test::listDir(LittleFS, "/", 3);
#endif
#endif
}

// button double click
void System::button_OnDblClick(PButton & b) {
    LOG_NOTICE("Button pressed - double click - wifi reconnect to AP");
    // set AP mode to always so will join AP if wifi ssid fails to connect
    EMSESP::esp32React.getAPSettingsService()->update([&](APSettings & apSettings) {
        apSettings.provisionMode = AP_MODE_ALWAYS;
        return StateUpdateResult::CHANGED;
    });
    // remove SSID from network settings
    EMSESP::esp32React.getNetworkSettingsService()->update([&](NetworkSettings & networkSettings) {
        networkSettings.ssid = "";
        return StateUpdateResult::CHANGED;
    });
    EMSESP::esp32React.getNetworkSettingsService()->callUpdateHandlers(); // in case we've changed ssid or password
}

// LED flash every 100ms
void System::led_flash() {
    static bool     led_flash_state_  = false;
    static uint32_t last_toggle_time_ = 0;
    uint32_t        current_time      = uuid::get_uptime();

    if (current_time - last_toggle_time_ >= 100) { // every 100ms
        led_flash_state_  = !led_flash_state_;
        last_toggle_time_ = current_time;

        if (led_flash_type_) {
            uint8_t intensity = led_flash_state_ ? RGB_LED_BRIGHTNESS : 0;
            EMSESP_RGB_WRITE(led_flash_gpio_, intensity, intensity, 0); // RGB LED - Yellow
        } else {
            digitalWrite(led_flash_gpio_, led_flash_state_ ? LED_ON : !LED_ON); // Standard LED
        }
    }

    // after duration, turn off the LED
    if (current_time - led_flash_start_time_ >= led_flash_duration_) {
        if (led_flash_type_) {
            EMSESP_RGB_WRITE(led_flash_gpio_, 0, 0, 0);
        } else {
            digitalWrite(led_flash_gpio_, !LED_ON);
        }
        led_flash_timer_ = false;
        command_format(nullptr, 0); // Execute format operation
    }
}

// Start the LED flash timer - duration in seconds
void System::start_led_flash(uint8_t duration) {
    // Don't start if already running
    if (led_flash_timer_) {
        return;
    }

    // Get LED settings
    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        led_flash_type_ = settings.led_type;
        led_flash_gpio_ = settings.led_gpio;
    });

    // Reset counter and state
    led_flash_start_time_ = uuid::get_uptime(); // current time
    led_flash_duration_   = duration * 1000;    // duration in milliseconds
    led_flash_timer_      = true;               // it's active
}

// button long press
void System::button_OnLongPress(PButton & b) {
    LOG_NOTICE("Button pressed - long press - restart EMS-ESP");
    EMSESP::system_.system_restart("boot");
}

// button indefinite press
void System::button_OnVLongPress(PButton & b) {
    LOG_NOTICE("Button pressed - very long press - perform factory reset");
    start_led_flash(5); // Start LED flash timer for 5 seconds
}

// push button
void System::button_init() {
#ifndef EMSESP_STANDALONE
    if (!myPButton_.init(pbutton_gpio_, HIGH)) {
        LOG_WARNING("Multi-functional button not detected");
        return;
    }
    LOG_DEBUG("Multi-functional button enabled");

    myPButton_.onClick(BUTTON_Debounce, button_OnClick);
    myPButton_.onDblClick(BUTTON_DblClickDelay, button_OnDblClick);
    myPButton_.onLongPress(BUTTON_LongPressDelay, button_OnLongPress);
    myPButton_.onVLongPress(BUTTON_VLongPressDelay, button_OnVLongPress);
#endif
}

// set the LED to on or off when in normal operating mode
void System::led_init() {
    // disabled old led port before setting new one
    led_type_ ? EMSESP_RGB_WRITE(led_gpio_, 0, 0, 0) : digitalWrite(led_gpio_, !LED_ON);

    if ((led_gpio_)) { // 0 means disabled
        if (led_type_) {
            // rgb LED WS2812B, use Neopixel
            EMSESP_RGB_WRITE(led_gpio_, 0, 0, 0);
        } else {
            pinMode(led_gpio_, OUTPUT);
            digitalWrite(led_gpio_, !LED_ON); // start with LED off
        }
    } else {
        LOG_INFO("LED disabled");
    }
}

void System::uart_init() {
    EMSuart::stop();
    EMSuart::start(tx_mode_, rx_gpio_, tx_gpio_); // start UART, GPIOs have already been checked
    EMSESP::txservice_.start();                   // reset counters and send devices request
}

// checks system health and handles LED flashing wizardry
// returns true if the LED flash is active
bool System::loop() {
    // check if we're supposed to do a reset/restart
    if (systemStatus() == SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED) {
        system_restart();
    }

    // if LED flashing is active, run the LED flash
    if (led_flash_timer_) {
        led_flash();
        return true; // is active
    }

    led_monitor();      // check status and report back using the LED
    myPButton_.check(); // check button press
    system_check();     // check system health

// syslog
#ifndef EMSESP_STANDALONE
    if (syslog_enabled_) {
        syslog_.loop();
    }
#endif

    send_info_mqtt();

    return false; // LED flashing is not active
}

// send MQTT info topic appended with the version information as JSON, as a retained flag
// this is only done once when the connection is established
void System::send_info_mqtt() {
    static uint8_t _connection = 0;
    uint8_t        connection  = (ethernet_connected() ? 1 : 0) + ((WiFi.status() == WL_CONNECTED) ? 2 : 0) + (ntp_connected_ ? 4 : 0) + (has_ipv6_ ? 8 : 0);
    // check if connection status has changed
    if (!Mqtt::connected() || connection == _connection) {
        return;
    }
    _connection = connection;
    JsonDocument doc;
    // doc["event"]   = "connected";
    doc["version"] = EMSESP_APP_VERSION;

    // if NTP is enabled send the boot_time in local time in ISO 8601 format (eg: 2022-11-15 20:46:38)
    // https://github.com/emsesp/EMS-ESP32/issues/751
    if (ntp_connected_) {
        char   time_string[25];
        time_t now = time(nullptr) - uuid::get_uptime_sec();
        strftime(time_string, 25, "%FT%T%z", localtime(&now));
        doc["bootTime"] = time_string;
    }

#ifndef EMSESP_STANDALONE
    if (EMSESP::system_.ethernet_connected()) {
        doc["network"]  = "ethernet";
        doc["hostname"] = ETH.getHostname();
        /*
        doc["MAC"]             = ETH.macAddress();
        doc["IPv4 address"]    = uuid::printable_to_string(ETH.localIP()) + "/" + uuid::printable_to_string(ETH.subnetMask());
        doc["IPv4 gateway"]    = uuid::printable_to_string(ETH.gatewayIP());
        doc["IPv4 nameserver"] = uuid::printable_to_string(ETH.dnsIP());
        if (ETH.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000" && ETH.localIPv6().toString() != "::") {
            doc["IPv6 address"] = uuid::printable_to_string(ETH.localIPv6());
    }
            */

